Repository: zamaniafshar/zamaniafshar.github.io
Catalog: lib/config/l10n/app_*.arb
Languages: fa

# aboutDescription
source: As a Flutter developer with several years of experience in developing cross-platform applications, I am adept at creating user-friendly, high-performance apps. With a deep understanding of architectural principles, clean coding practices, and code optimization, I am skilled at working closely with diverse teams to drive the successful delivery of complex projects. My ability to effectively collaborate and communicate ensures that challenges are met with innovative solutions. Furthermore, my commitment to staying current with the latest trends and technologies in the Flutter ecosystem empowers me to deliver cutting-edge solutions.
fa: به عنوان یک توسعه‌دهنده فلاتر با چندین سال تجربه در طراحی و توسعه برنامه‌های کراس پلتفرم، توانایی ایجاد اپلیکیشن‌های کاربرپسند و با عملکرد بالا را دارم. دارای دانش و درک بالا از اصول معماری، کدنویسی تمیز و بهینه‌سازی کد، به خوبی می‌توانم با تیم‌های مختلف همکاری کرده و پروژه‌های پیچیده را به موفقیت برسانم. همچنین، به روز بودن با آخرین ترندها و فناوری‌ها در دنیای فلاتر از نقاط قوت من است که به ارائه راهکارهای نوآورانه کمک می‌کند.

source: About Me
fa: درباره من

# aboutMeTitle
source: Hello, I'm Mohammad Amin Zamani afshar
fa: سلام من محمد امین زمانی افشار هستم

source: Contact
fa: ارتباط با من

# contactAddress
source: Iran, Kerman, Baft
fa: ایران، کرمان، بافت

# contactComment
source: Comment
fa: پیام

# contactCommentHint
source: Type Comment
fa: پیام خود را بنویسید

# contactDescription
source: Here you can let me know if you have any criticism, suggestion or problem, I'm waiting to hear your voice or see your message.
fa: اگر انتقاد، پیشنهاد یا مشکلی دارید به من اطلاع دهید، منتظر شنیدن صدای شما یا دیدن پیام شما هستم.

# contactEmail
source: Email
fa: ایمیل

# contactEmailHint
source: Email Address
fa: آدرس ایمیل

# contactEmptyFormError
source: Please enter your {label}.
fa: لطفا {label} خود را وارد کنید.

# contactInfoDescription
source: You can get my contact information here and if you like, you can see the urls of my pages on social networks from the top of the page and find me there.
fa: اطلاعات تماسم رو میتونی اینجا بگیری و اگر هم دوست داشتی می تونی از ابتدای صفحه آدرس های صفحات من رو در شبکه های اجتماعی رو ببینی و از اون جا منو پیدا کنی

# contactInfoTitle
source: What is your plan ? Call me
fa: برنامه ات چیه ؟ باهام تماس بگیر

# contactInvalidEmailFormError
source: Please input a valid email.
fa: لطفا یک ایمیل معتبر وارد کنید.

# contactMeButton
source: Contact Me
fa: ارتباط با من

# contactName
source: Name
fa: نام

# contactNameHint
source: Full Name
fa: نام کامل

# contactSendEmailTitle
source: What's Up?
fa: چه خبر؟

# contactSendMessageFailureTitle
source: Failed to send message, please try again.
fa: مشکلی پیش آمده است، لطفا مجددا تلاش کنید.

# contactSendMessageSuccessTitle
source: Message successfuly sent.
fa: پیام شما با موفقیت ارسال شد.

# contactSubject
source: Subject
fa: موضوع

# contactTitle
source: Get In Touch
fa: در تماس باشید

source: Desktop Development
fa: توسعه دسکتاپ

# desktopDevelopmentDescription
source: As a desktop developer, I create feature-rich apps that run on various operating systems. Whether standalone or enterprise-level software, I design and build apps to meet your specific needs.
fa: به عنوان یک توسعه‌دهنده دسکتاپ، من برنامه‌هایی با طراحی مدرن و قابل اعتماد ایجاد می‌کنم که نیازهای شما را برآورده می‌کنند. اعم از برنامه‌های مستقل تا نرم‌افزار سطح شرکتی، من برنامه‌هایی را ساخته و طراحی می‌کنم که در هر محیطی به خوبی عمل کنند.

source: Download Resume
fa: دانلود رزومه

source: Hire Me
fa: استخدام

source: Home
fa: خانه

# homeJobTitle
source: A Flutter Developer
fa: توسعه دهنده فلاتر

# homeWelcome
source: Welcome I'm
fa: خوش آمدید

# jobTitle
source: Flutter Developer
fa: توسعه دهنده فلاتر

# languageNameEnglish
source: English
fa: انگلیسی

# languageNamePersian
source: Persian
fa: فارسی

source: Language Skills
fa: زبان ها

# languageSkillsDescription
source: One of my hobbies is studying and learning languages. I try to be able to learn and use my favorite languages.
fa: یکی از علاقه هام مطالعه و یادگیری زبانه ، تلاشم رو میکنم که بتونم زبان های مورد علاقه ام رو یاد بگیرم و ازشون استفاده کنم.

source: Mobile Development
fa: توسعه موبایل

# mobileDevelopmentDescription
source: With expertise in mobile development, I can create user-friendly apps for iOS and Android. Whether native or cross-platform, I build apps optimized for performance, security, and scalability.
fa: با تخصص در توسعه اپلیکیشن‌های موبایل، می‌توانم برنامه‌های کاربردی جذاب برای سیستم‌عامل‌های ای او اس و اندروید طراحی کنم. اعم از برنامه‌های نیتیو یا کراس‌پلتفرم، من برنامه‌هایی با بهینه‌سازی عملکرد، امنیت و قابلیت مقیاس‌پذیری ایجاد می‌کنم که نیازهای شما را برآورده کند.

# myName
source: Mohammad Amin Zamani afshar
fa: محمد امین زمانی افشار

# services
source: My Services
fa: خدمات من

source: Skills
fa: مهارت ها

# skillsDescription
source: Here you can see my skills, one of the fascinations of the computer world is the momentary changes of technologies, but I try to update my knowledge every day and experience new technologies.
fa: اینجا میتونی مهارت های منو ببینی، یکی از جذابیت های دنیای کامپیوتر تغییرات لحظه ای تکنولوژی هاست ولی سعی میکنم که هر روز دانشم رو آپدیت کنم و تکنولوژی های جدید رو تجربه کنم.

source: Web Development
fa: توسعه وب

# webDevelopmentDescription
source: I specialize in creating dynamic web applications tailored to your needs. Whether it's a simple web app or a complex solution, I can design and develop an application that meets your goals and user requirements.
fa: به دنبال ساخت وب اپلیکیشنی منحصر به‌ فرد که با نیازهای شما هماهنگ باشد هستید؟ من در طراحی و توسعه برنامه‌های وب پویا و سفارشی تخصص دارم و با توجه به هدف‌ها و نیازهای کاربران شما، می‌توانم برنامه‌های وب ساده یا پیچیده منطبق با نیاز های شما طراحی و توسعه دهم.
